ПД_sev/src/Documents/СчетПокупателя/СчетПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетПокупателя</name>
  <basedOn>Document.СчетПоставщика</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПрибыльПоПроектам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументов</name>
    <type>
      <types>EnumRef.СтатусыПодготовкиДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставленыКлиенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерFM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыСформированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>УИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмКодАктивации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/Documents/СчетПокупателя/ManagerModule.bsl
Функция ПечатьСчетНаОплату(СсылкаСчет, ПоДоверенности = Неопределено, СПечатью = Ложь) Экспорт 
	Макет = ПолучитьМакет("ПФ_MXL_СчетЗаказ");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату";	

	ШапкаЗапрос = Новый Запрос;
	ШапкаЗапрос.Текст ="ВЫБРАТЬ
	                   |	СчетПокупателя.Контрагент КАК Контрагент,
	                   |	СчетПокупателя.Контрагент.ПолноеНаименование КАК ПредставлениеПолучателя,
	                   |	СчетПокупателя.Организация КАК Организация,
	                   |	СчетПокупателя.Организация.ПолноеНаименование КАК ПредставлениеПоставщика,
	                   //|	СчетПокупателя.Представление КАК ТекстЗаголовка,
	                   |	СчетПокупателя.Организация.БанкПолучателя КАК БанкПолучателя,
	                   |	СчетПокупателя.Организация.БИКБанкаПолучателя КАК БИКБанкаПолучателя,
	                   |	СчетПокупателя.Организация.СчетБанкаПолучателя КАК СчетБанкаПолучателя,
	                   |	СчетПокупателя.Организация.СчетПолучателя КАК СчетПолучателя,
	                   |	СчетПокупателя.Организация.ИНН КАК ИНН,
	                   |	СчетПокупателя.Организация.КПП КАК КПП,
					   |	СчетПокупателя.Контрагент.КПП КАК КПППолучатель,
					   |	СчетПокупателя.Контрагент.ИНН КАК ИННПолучатель,
	                   |	СчетПокупателя.Организация.ФИОРуководителя КАК ФИОРуководителя,
	                   |	СчетПокупателя.Организация.ФИОБухгалтера КАК ФИОБухгалтера,
	                   |	СчетПокупателя.Организация.ЮридическийАдрес КАК ЮридическийАдрес,
					   |	СчетПокупателя.Контрагент.ЮридическийАдрес КАК ЮридическийАдресПолучатель,
	                   |	СчетПокупателя.Товары.(
	                   |		Ссылка КАК Ссылка,
	                   |		НомерСтроки КАК НомерСтроки,
	                   |		Наименование КАК Товар,
	                   |		Количество КАК Количество,
	                   |		ВЫРАЗИТЬ(СчетПокупателя.Товары.Сумма / СчетПокупателя.Товары.Количество КАК ЧИСЛО(10, 2)) КАК Цена,
	                   |		Сумма КАК Сумма,
	                   |		Услуга КАК Услуга
	                   |	) КАК Товары,
	                   |	СчетПокупателя.СуммаДокумента КАК СуммаДокумента,
	                   |	СчетПокупателя.Организация.ФИОРуководителя КАК ОрганизацияФИОРуководителя,
	                   |	СчетПокупателя.Организация.ФИОБухгалтера КАК ОрганизацияФИОБухгалтера,
	                   |	СчетПокупателя.НомерFM КАК НомерFM,
	                   |	СчетПокупателя.Дата КАК Дата
	                   |ИЗ
	                   |	Документ.СчетПокупателя КАК СчетПокупателя
	                   |ГДЕ
	                   |	СчетПокупателя.Ссылка = &СсылкаСчет";					   
	ШапкаЗапрос.УстановитьПараметр("СсылкаСчет", СсылкаСчет);
	ВыборкаШапка = ШапкаЗапрос.Выполнить().Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
		ОбластьШапка.Параметры.ТекстЗаголовка = "Счет покупателя " + ВыборкаШапка.НомерFM + " от " + Формат(ВыборкаШапка.Дата,"ДФ=dd.MM.yyyy"); 
		ОбластьШапка.Параметры.ПредставлениеПоставщика = ВыборкаШапка.ПредставлениеПоставщика + ", ИНН " + ВыборкаШапка.ИНН + ", КПП " + ВыборкаШапка.КПП + ", " + ВыборкаШапка.ЮридическийАдрес;
		ОбластьШапка.Параметры.ПредставлениеПолучателя = ВыборкаШапка.ПредставлениеПолучателя + ", ИНН " + ВыборкаШапка.ИННПолучатель + ", КПП " + ВыборкаШапка.КПППолучатель + ", " + ВыборкаШапка.ЮридическийАдресПолучатель;
		ТабДок.Вывести(ОбластьШапка);
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДок.Вывести(ОбластьШапкаТаблицы);		
		
		ВыборкаТовары = ВыборкаШапка.Товары.Выбрать();
		КоличествоНаименований = 0;
		Пока ВыборкаТовары.Следующий() Цикл 
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		    ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьСтрока);	
			КоличествоНаименований = КоличествоНаименований + 1;
		КонецЦикла;
		ОбластьИтог = Макет.ПолучитьОбласть("Итого");
		ОбластьИтог.Параметры.Всего = ВыборкаШапка.СуммаДокумента;
		ТабДок.Вывести(ОбластьИтог);
		
		ОбластьИтогНДС = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьИтогНДС.Параметры.НДС = "В том числе НДС:";
		ОбластьИтогНДС.Параметры.ВсегоНДС =  Формат(ВыборкаШапка.СуммаДокумента -  ВыборкаШапка.СуммаДокумента / 1.18, "ЧДЦ=2");
		ТабДок.Вывести(ОбластьИтогНДС);
		
		ОбластьИтогСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьИтогСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + Строка(КоличествоНаименований) + ", на сумму " + Формат(ВыборкаШапка.СуммаДокумента, "ЧДЦ=2") + " руб.";		
		ПараметрыПрописиНаРусском = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		ОбластьИтогСуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(ВыборкаШапка.СуммаДокумента, ,ПараметрыПрописиНаРусском);
		ТабДок.Вывести(ОбластьИтогСуммаПрописью);
		Если СПечатью Тогда
			Если ВыборкаШапка.Организация = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеСправочникаПОКоду("Организации", "000000002") Тогда 
				ОбластьПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчетаСПечатьюИР");
			ИначеЕсли ВыборкаШапка.Организация = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеСправочникаПОКоду("Организации", "000000001") Тогда 	
				ОбластьПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчетаСПечатьюТР");	
			Иначе
				ОбластьПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчета");	
			КонецЕсли;
		Иначе
			ОбластьПодвалСчета = Макет.ПолучитьОбласть("ПодвалСчета");
		КонецЕсли;
		Если ПоДоверенности = Неопределено Тогда
			ФИОРуководителя = ВыборкаШапка.ФИОРуководителя;
			ФИОБухгалтера = ВыборкаШапка.ФИОБухгалтера;
		Иначе
			ФИОРуководителя = ПоДоверенности;
			ФИОБухгалтера = ПоДоверенности;
			ОбластьПодвалСчета.Параметры.Доверенность = УправлениеПользователями.ПолучитьДовереностьПользователя(ПоДоверенности, ВыборкаШапка.Организация);;
		КонецЕсли;
		ОбластьПодвалСчета.Параметры.ФИОРуководителя = ФИОРуководителя; 
		ОбластьПодвалСчета.Параметры.ФИОБухгалтера = ФИОБухгалтера; 
		ТабДок.Вывести(ОбластьПодвалСчета);
		
		//ОбластьПодвалЗаказа = Макет.ПолучитьОбласть("ПодвалЗаказа");
		//Если ПоДоверенности = Неопределено Тогда
		//	ФИОИсполнителя = ВыборкаШапка.ФИОРуководителя;
		//Иначе
		//	ФИОИсполнителя = ПоДоверенности;
		//КонецЕсли;
		//ОбластьПодвалЗаказа.Параметры.ФИОИсполнителя = ФИОИсполнителя;
		//ТабДок.Вывести(ОбластьПодвалЗаказа);
	КонецЕсли;
	
	Возврат ТабДок;
КонецФункции

Функция ПолучитьМассивСчетовПоНомеруFM(НомерFM) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетПокупателя.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетПокупателя КАК СчетПокупателя
	               |ГДЕ
	               |	НЕ СчетПокупателя.ПометкаУдаления
	               |	И СчетПокупателя.НомерFM = &НомерFM
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("НомерFM", НомерFM);
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("Ссылка");
КонецФункции

Процедура УстановитьПометкуСчетОплачен(СчетСсылка) Экспорт 
	Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ОбъектСчет = СчетСсылка.ПолучитьОбъект();
	ОбъектСчет.Оплачен = Истина;
	ОбъектСчет.Записать(РежимЗаписиДокумента.Проведение);
	Если ЗначениеЗаполнено(СчетСсылка.Проект) И ЗначениеЗаполнено(СчетСсылка.Проект.Куратор) Тогда
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",  СчетСсылка.Проект.Куратор);
	ИначеЕсли ЗначениеЗаполнено(СчетСсылка.Изменил) Тогда 
		Пользователь = СчетСсылка.Изменил; 			
	КонецЕсли;

	Если НЕ Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
		И Пользователь.ТелеграмИД > 0 Тогда
		ТекстСообщения = "По счету №" + СчетСсылка.НомерFM + " Контрагент " + СчетСсылка.Контрагент + "(Сумма: " + СчетСсылка.СуммаДокумента + "), получена оплата.";	
		ИнтеграцияСTelegramСервер.СообщениеПользователю(Новый Структура("id", Пользователь.ТелеграмИД), ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТабДокДолжников(ИмяВарианта) Экспорт 
	//МассивструктурОтбор = Новый Массив;
	//МассивструктурОтбор.Добавить(Новый Структура("ЛевоеЗначение, ВидСравнения, ПравоеЗначение", "Сотрудник", "Равно", ПорогДолга));
	стрТабДок = УправлениеОтчетамиСервер.ПолучитьТабДокИзОтчетаСКД("ВзаиморасчетыСКонтрагентами", "ОсновнаяСхемаКомпоновкиДанных", ИмяВарианта); 
	ОтчетПоПроекту = стрТабДок.ТабДок;	
	Возврат ОтчетПоПроекту;
КонецФункции
